
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        6 |           4 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                              |
|:--------:|:-------------------------------------------------------------------------------------------------------|
|    🟢    | `module.ci-tester["lambda-monitored-tester"].aws_iam_policy.pytest-permissions`                        |
|    🟢    | `module.ci-tester["lambda-monitored-tester"].aws_iam_policy.role-permissions`                          |
|    🟢    | `module.ci-tester["lambda-monitored-tester"].aws_iam_role.role-tester`                                 |
|    🟢    | `module.ci-tester["lambda-monitored-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢    | `module.ci-tester["lambda-monitored-tester"].aws_iam_role_policy_attachment.role-permissions`          |
|    🟢    | `module.ci-tester["lambda-monitored-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`   |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`                                     |
|    🟡    | `module.actions-runner-noble.aws_launch_template.actions-runner`                                       |
|    🟡    | `module.registry.module.ecs.module.pod[0].aws_autoscaling_group.website`                               |
|    🟡    | `module.registry.module.ecs.module.pod[0].aws_launch_template.website`                                 |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "23" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (14 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-0fe52afb929ab485f"
      ~ image_id                             = "ami-01a98b5c01d47cf0a" -> "ami-037b750fa024ba510"
      ~ latest_version                       = 23 -> (known after apply)
        name                                 = "actions-runner-20250505203133193000000009"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ci-tester["lambda-monitored-tester"].aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "pytest-permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.ci-tester["lambda-monitored-tester"].aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda-monitored-tester-permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.ci-tester["lambda-monitored-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/lambda-monitored-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-lambda-monitored:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-lambda-monitored"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "lambda-monitored-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["lambda-monitored-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "lambda-monitored-tester"
    }

  # module.ci-tester["lambda-monitored-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda-monitored-tester"
    }

  # module.ci-tester["lambda-monitored-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda-monitored-tester"
    }

  # module.registry.module.ecs.module.pod[0].aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "terraf2025102923102096090000001e"
        name                             = "terraf2025102923102096090000001e"
        # (32 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "1" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (16 unchanged blocks hidden)
    }

  # module.registry.module.ecs.module.pod[0].aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-036ff5ae555e63974"
      ~ image_id                             = "ami-043edb83cdf118598" -> "ami-00882dac0dae1bbd2"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "terraf2025102923101509340000001b"
        tags                                 = {
            "AmazonECSManaged"      = "true"
            "Name"                  = "terraform-registry"
            "VantaContainsEPHI"     = "false"
            "VantaContainsUserData" = "false"
            "VantaNonProd"          = "true"
            "account"               = "303467602807"
            "created_by_module"     = "infrahouse/website-pod/aws"
            "environment"           = "development"
            "parent_module"         = "infrahouse/ecs/aws"
            "service"               = "terraform-registry"
            "upstream_module"       = "infrahouse/ecs/aws"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 6 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDYsICJjaGFuZ2UiOiA0LCAiZGVzdHJveSI6IDB9fQ==
```
</details>